
#include <Arduino.h>
/*
// Конвертировать в нижний регистр
(x | ' ');
('a' | ' ') => 'a';  // пример
('A' | ' ') => 'a';  // пример

// Конвертировать в верхний регистр
(x & '_');
('a' & '_') => 'A';  // пример
('A' & '_') => 'A';  // пример

// Инвертировать регистр
(x ^ ' ');
('a' ^ ' ') => 'A';  // пример
('A' ^ ' ') => 'a';  // пример

// Позиция буквы в алфавите (англ)
(x & "\x1F");
('a' & "\x1F") => 1;  // пример
('B' & "\x1F") => 2;  // пример

// Позиция большой буквы в алфавите (англ)
(x & '?') или (x ^ '@');
('C' & '?') => 3;  // пример
('Z' ^ '@') => 26; // пример

// Позиция строчной буквы в алфавите (англ)
(x ^ '`');
('d' ^ '`') => 4;   // пример
('x' ^ '`') => 24;  // пример

// Serial.println(u_encode(0x2605)); 
String u_encode(uint32_t c) {
  char b1 = 0, b2 = 0, b3 = 0, b4 = 0;
  if (c < 0x80) {
    b1 = c & 0x7F | 0x00;
  } else if (c < 0x0800) {
    b1 = c >> 6 & 0x1F | 0xC0;
    b2 = c >> 0 & 0x3F | 0x80;
  } else if (c < 0x010000) {
    b1 = c >> 12 & 0x0F | 0xE0;
    b2 = c >> 6 & 0x3F | 0x80;
    b3 = c >> 0 & 0x3F | 0x80;
  } else if (c < 0x110000) {
    b1 = c >> 18 & 0x07 | 0xF0;
    b2 = c >> 12 & 0x3F | 0x80;
    b3 = c >> 6 & 0x3F | 0x80;
    b4 = c >> 0 & 0x3F | 0x80;
  }
  String s;
  s.reserve(4);
  s += b1;
  s += b2;
  s += b3;
  s += b4;
  return s;
}
*/